@echo off
chcp 65001 > nul
rem 创建菜单
echo 1、红烧鲫鱼		2、油闷大虾 > .\menu.txt
echo 3、番茄炒鸡蛋		4、干煸土豆丝 >> .\menu.txt
echo 5、口水鸡 >> .\menu.txt
echo ==========================================================
echo.
for /l %%i in (1, 1, 18) do set /p=■<nul & ping -n 1 127.0.0.1>nul
echo 100%%
echo.
echo ==========================================================
echo 菜单初始化完成
echo.
echo 菜单：
echo.
echo ----------------------------------------------------------
echo.
type .\menu.txt
echo.
echo ----------------------------------------------------------
set /p menuName=请输入菜名后按回车：
echo 好的，客官，您稍等，马上来！
echo.
echo ----------------------------------------------------------
echo.
echo 厨师炒菜中
for /l %%i in (1, 1, 18) do set /p=.<nul & ping -n 2 127.0.0.1>nul
echo.
echo ----------------------------------------------------------
echo.
echo 客官，您的%menuName%好了，请慢用！
echo.
echo ----------------------------------------------------------
echo.
del .\menu.txt
echo 收尾工作完毕
pause